#+TITLE: Eval Graph Builder
#+AUTHOR: Rodrigo Garía G#+EMAIL: rodrigo.garcia21111@gmail.com


**** code
#+BEGIN_SRC lisp +n -r :results output :exports none 
  (let* (
   (c1 (basic-cvrp-client 1 1))
   (c2 (basic-cvrp-client 2 7))
   (c3 (basic-cvrp-client 3 4))
   (c4 (basic-cvrp-client 4 3))
   (c5 (basic-cvrp-client 5 2))
   (c6 (basic-cvrp-client 6 1))

   (v1 (cvrp-vehicle 1 9))
   (v2 (cvrp-vehicle 2 18))

   (d0 (basic-depot))

   ;; Solution for the eval-graph
   ;; remember to start and end all the routes with depot
   ;; the starting depot is placed in the previous-client slot
   (r1 (route-for-simulation :id 1 :vehicle v1 :depot d0
					  :clients (list c1 c2 c3 (clone d0)) :previous-client (clone d0)))
   (r2 (route-for-simulation :id 2 :vehicle v2 :depot d0
					  :clients (list c4 c5 c6 (clone d0)) :previous-client (clone d0)))

   (s1 (basic-solution :id 1 :routes (list r1 r2)))

   (s2 (neigh-tree-solution s1)))

   (format t "~a" s2))


#+END_SRC

#+RESULTS:
: S1: (0)
: routes:
:   <r1: <cv:1. 0/9> (<d:0>: (<c1: 1> <c2: 7> <c3: 4>))>
:   <r2: <cv:2. 0/18> (<d:0>: (<c4: 3> <c5: 2> <c6: 1>))>


**** test
#+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/eval-graph-builder-test.lisp
    (with-basic-clients (1 2 3 4 5 6)
	  (let* ((v1 (basic-vehicle 1))
		 (v2 (basic-vehicle 2))
		 (d0 (basic-depot))
		 (r1 (basic-route :id 1 :vehicle v1 :depot d0
				  :clients (list c1 c2 c3)))
		 (r2 (basic-route :id 2 :vehicle v2 :depot d0
				  :clients (list c4 c5 c6)))
		 (s (basic-solution :id 1 :routes (list r1 r2)))
		 (graph (init-graph s)))

	    (format t "~a~%" graph)))
 
            
#+END_SRC

#+RESULTS:
#+begin_example
<EVAL-GRAPH: 
 output: NIL  
 inputs: 
  <Cliient node <c:1>, 
     first-distance-calculator: NIL, 
     second-distance-calculator: NIL, 
     demand-calculator: NIL>
  <Cliient node <c:2>, 
     first-distance-calculator: NIL, 
     second-distance-calculator: NIL, 
     demand-calculator: NIL>
  <Cliient node <c:3>, 
     first-distance-calculator: NIL, 
     second-distance-calculator: NIL, 
     demand-calculator: NIL>
  Vehicle node, content: <v:1>, accumulator: NIL>
  <Input node, content: <r1: <v:1> (<d:0>: (<c:1> <c:2> <c:3>))>>
  <Cliient node <c:4>, 
     first-distance-calculator: NIL, 
     second-distance-calculator: NIL, 
     demand-calculator: NIL>
  <Cliient node <c:5>, 
     first-distance-calculator: NIL, 
     second-distance-calculator: NIL, 
     demand-calculator: NIL>
  <Cliient node <c:6>, 
     first-distance-calculator: NIL, 
     second-distance-calculator: NIL, 
     demand-calculator: NIL>
  Vehicle node, content: <v:2>, accumulator: NIL>
  <Input node, content: <r2: <v:2> (<d:0>: (<c:4> <c:5> <c:6>))>>
 
 solution-track: S1: (0)
routes:
  <r1: <v:1> (<d:0>: (<c:1> <c:2> <c:3>))>
  <r2: <v:2> (<d:0>: (<c:4> <c:5> <c:6>))>
>
#+end_example

*** test
#+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/eval-graph-builder-test.lisp
  (with-basic-clients (1 2)
    (let* ((v1 (basic-vehicle 1))
	   (d0 (basic-depot))
	   (r1 (route-for-simulation :id 1 :vehicle v1 :depot d0
			    :clients (list c1 c2 d0) :previous-client d0))
	   (s (basic-solution :id 1 :routes (list r1)))
	   (out (new-output-node :output-value 0))
	   (graph (init-graph s))
	   (dist-mat #2A((0 1 2) (1 0 2) (2 2 0))))
      (progn
	(setf (gethash 'total-distance (slot-to-output graph)) out)
	(loop for r in (routes s) do
	  (progn
	    (loop for c in (clients r) do
	      (progn 
		(move-node-from-to (previous-client r) c 'total-distance dist-mat graph)
		(setf (previous-client r) c)))))
	(format t "EVALUATION (should be 5): ~a~%" (output-value out))
	(format t "~a~%" graph))))

#+END_SRC

#+RESULTS:
#+begin_example
EVALUATION (should be 5): 5
<EVAL-GRAPH: 
 output: NIL  
 inputs: 
  <Depot node, content: <d:0>, demand: NIL>
  <Cliient node <c:1>, 
     first-distance-calculator: <output: <Output node, value: 5>>, 
     second-distance-calculator: <output: <Output node, value: 5>>>
  <Cliient node <c:2>, 
     first-distance-calculator: <output: <Output node, value: 5>>, 
     second-distance-calculator: <output: <Output node, value: 5>>>
  <Depot node, content: <d:0>, demand: NIL>
  <Vehicle node, content: <v:1>, accumulator: NIL>
  <Input node, content: <r1: <v:1> (<d:0>: (<c:1> <c:2> <d:0>))>>
 
 client-buffer: #<HASH-TABLE :TEST EQL :COUNT 0 {1006478B13}> 

 solution-track: S1: (0)
routes:
  <r1: <v:1> (<d:0>: (<c:1> <c:2> <d:0>))>
>
#+end_example

